transaction중에서도 코인의 움직임이 존재하고 주고 받은 주소가 있는 내역이 transfer이다. transaction은 vote, contract 등에 더욱 다양한 데이터가 담겨져 있지만 우리의 분석에는 큰 필요성이 없으므로 생략했다.

코인들을 보면 자체 체인을 가진 코인들도 존재하고, 특정 체인 위에 contract(eth에 경우 smart contract라고 불리기도 하지만 여기선 contract로 명칭을 통일해서 사용) 형태로 존재하기도 한다.
자체 체인을 가진 코인 : Bitcoin, Ethereum, Ripple, Solana, etc...
자체 체인을 가지지 않은 코인 : Cobak Token, SOMESING, pepe, etc...
자체 체인을 가지고 있으면 transaction 정보도 존재하지만, 아닌경우에는 transfer 데이터만 존재한다. 

데이터를 제공해주는 업체는 그리 많지 않고, 직접 노드를 운영하는 것에는 높은 사양에 컴퓨터가 필요해서 시작이 쉽지 않았다. 
또한 자체 API의 경우 기간에 모든 데이터가 아닌, 특정 지갑이나 특정 거래에 한정되어서 추출할 수 있게 해둔 경우가 대다수라서 해당 서비스를 만드는 것이 반드시 필요하다는 생각도 들었다.
1. Bitquery
  많은 체인의 데이터를 제공해주는 유명한 사이트이다. graphQL형태로 작성하여서 해당서버에 원하는 정보를 요청해서 받을 수 있다. 우리는 과거 데이터를 원했기의 V1을 주로 이용했고, 해당 사이트를 이용해서 AVAX, SOL, Ripple 등에 내용을 추출했다.
  한번에 25,000개의 데이터를 제공해주며 offset 변수를 이용해서 이후에 데이터도 조회할 수 있다. python의 request를 활용하여 json 형태로 일차로 저장한 후에 csv파일로 변환하여 사용했다.
2. Google Bigquery
  Solana transfer을 뽑을려 할 때, 너무 용량이 커서 bigquery를 이용해서 분석을 진행하려고 시도했다. 해당 서비스에 데이터를 무료로 공개해둔 코인이 Doge, Ripple, Polygon, Solana 등으로 꽤 있어서 유용할 것이라 판단되어 이용해보려고 시도했다.
  Python이나 SQL 형태로 원하는 데이터를 가져와서 분석하는데 사용할 수 있었다. Ripple이나 Doge와 같은 경우에는 용량이 그렇게 크지 않아서 사용할만 했지만 주요목적이었던 Solana의 경우는 일부 데이터를 불러오는데에 너무 많은 비용이 수반되고, Python으로 여는 것조차 안 되어 포기했다.
  그래도 해당 서비스를 통해 새로운 경험을 해보았다.
3. Chain API
  기본적으로 모든 체인은 API가 존재한다. 그러나 우리가 원하는 정보를 제공해주는 API는 거의 존재하지 않았다 대부분 특정 지갑이나 거래에 대해서 조회할 때나 사용할 수 있게 설계되어 있어서 전체기간을 필요로하는 분석의 목적상 적합하지 않았다.
  그래도 몇몇 API는 block 전체의 데이터를 제공해주어 block형태로 뽑아낸 후에 가공할 수 있는 가능성을 엿보았다. TON이랑 AVAIL이 그런 경우인데, TON과 같은 경우엔 한번에 추출할 수 있는 블록의 양이 256개로 전체 블록의 비해 양이 너무적고, 한 블록에 담긴 데이터에 우리가 필요로 하지 않는 정보들도 많았다.
  AVAIL의 경우도 시도하다가 전체 기간의 transfer를 추출할 방법을 찾지 못해서 포기했다.
4. Subscan API
  그래도 AVAIL의 데이터는 반드시 필요해서 찾다가 Subscan이란 사이트를 찾았는데, 여기는 bitquery처럼 완벽히 필요한 정보만 골라내어 처리할 수 있진 않지만 block 형태로 뽑아내어서 추후에 정리하는 식으로 가능했다. AVAIL의 경우 신생 체인으로 block의 개수가 그리 많지 않아 오랜 시간이 걸리지 않았다.
  해당 API에서는 다양한 코인의 데이터도 제공해주므로 알아두면 유용할 것 같다.
